In [2]:
import pandas as pd

In [3]:
data = [i for i in range(1,6)]
series = pd.Series(data)
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
data = {"a":1,"b":2}
series = pd.Series(data)
series

a    1
b    2
dtype: int64

In [5]:
data = [i for i in range(1,6)]
index =[i for i in range(5,10)]
series_data_index = pd.Series(data,index=index)
series_data_index

5    1
6    2
7    3
8    4
9    5
dtype: int64

In [6]:
data = {
    "name " : ["harsha","vijay","guna"],
    "age" : [40,30,18],
    "city" : ["ch","ny","chennai"]
}
df = pd.DataFrame(data)
data

{'name ': ['harsha', 'vijay', 'guna'],
 'age': [40, 30, 18],
 'city': ['ch', 'ny', 'chennai']}

In [7]:
data =[
    {"name": "harsha","age":20,"city":"chennai"},
    {"name": "vijay","age":19,"city":"chennai"},
    {"name": "guna","age":28,"city":"chennai"},
    
]
df = pd.DataFrame(data)
df.head()

     name  age     city
0  harsha   20  chennai
1   vijay   19  chennai
2    guna   28  chennai

In [8]:
df["age"] = df["age"]+1

In [9]:
data=df.iloc[1]
data

name      vijay
age          20
city    chennai
Name: 1, dtype: object

In [10]:
df.at[1,"age"]

np.int64(20)

In [11]:
df.iat[1,2]

'chennai'

In [12]:
#add a column 
df["salary"] = [5000,6000,70000]
df

     name  age     city  salary
0  harsha   21  chennai    5000
1   vijay   20  chennai    6000
2    guna   29  chennai   70000

In [13]:
df

     name  age     city  salary
0  harsha   21  chennai    5000
1   vijay   20  chennai    6000
2    guna   29  chennai   70000

In [14]:
df.drop(labels="salary",inplace=True,axis=1)

In [15]:
df

     name  age     city
0  harsha   21  chennai
1   vijay   20  chennai
2    guna   29  chennai

In [16]:
df.describe()

             age
count   3.000000
mean   23.333333
std     4.932883
min    20.000000
25%    20.500000
50%    21.000000
75%    25.000000
max    29.000000